/*
 Navicat Premium Data Transfer

 Source Server         : aaa
 Source Server Type    : MySQL
 Source Server Version : 80011
 Source Host           : localhost:3306
 Source Schema         : myclass

 Target Server Type    : MySQL
 Target Server Version : 80011
 File Encoding         : 65001

 Date: 12/07/2018 11:51:22
*/

SET NAMES utf8mb4;
SET FOREIGN_KEY_CHECKS = 0;

-- ----------------------------
-- Table structure for class2016201110
-- ----------------------------
DROP TABLE IF EXISTS `class2016201110`;
CREATE TABLE `class2016201110`  (
  `Cid` int(4) NULL DEFAULT NULL,
  `Cname` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `Cteach` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `Clast` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `Ctime` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `Cadr` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `Cday` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  PRIMARY KEY (`Cname`, `Ctime`, `Cday`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 1 CHARACTER SET = utf8 COLLATE = utf8_general_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of class2016201110
-- ----------------------------
INSERT INTO `class2016201110` VALUES (1, '体育', '房巍', '3-18(周)', '[03-04节]', '工程训练中心旧址', '1');
INSERT INTO `class2016201110` VALUES (1, '创业运营演练', '彭尔霞', '1-4,6-8(周)', '[06-07节]', '31#416', '6');
INSERT INTO `class2016201110` VALUES (1, '创业运营演练', '彭尔霞', '1-4,6-7(周)', '[08-10节]', '31#416', '6');
INSERT INTO `class2016201110` VALUES (1, '大学英语', '李宝峰', '1-4,6-17(周)', '[03-04节]', '41#415', '5');
INSERT INTO `class2016201110` VALUES (1, '形势与政策', '胡泊', '2,4,6,8(周)', '[06-07节]', '1#S103', '1');
INSERT INTO `class2016201110` VALUES (1, '操作系统', '刘刚', '1-8(周)', '[08-10节]', '21B', '3');
INSERT INTO `class2016201110` VALUES (1, '操作系统', '刘刚', '1-4,6-9(周)', '[08-10节]', '21B', '4');
INSERT INTO `class2016201110` VALUES (1, '操作系统实验', '刘刚', '14-17(周)', '[01-04节]', '计算中心376室', '4');
INSERT INTO `class2016201110` VALUES (1, '操作系统实验', '刘刚', '14-17(周)', '[06-09节]', '计算中心376室', '2');
INSERT INTO `class2016201110` VALUES (1, '数据库原理', '徐悦竹', '3-8,10-11(周)', '[01-02节]', '21B', '2');
INSERT INTO `class2016201110` VALUES (1, '数据库原理', '徐悦竹', '3-4,6-11(周)', '[01-02节]', '21B', '4');
INSERT INTO `class2016201110` VALUES (1, '数据库原理', '徐悦竹', '5-6(周)', '[03-04节]', '计算中心575室', '2');
INSERT INTO `class2016201110` VALUES (1, '数据库原理', '徐悦竹', '4,6(周)', '[03-04节]', '计算中心276室', '4');
INSERT INTO `class2016201110` VALUES (1, '机械设计基础B', '贾鹏', '1-8(周)', '[01-02节]', '11#132大', '1');
INSERT INTO `class2016201110` VALUES (1, '机械设计基础B', '贾鹏', '1-2,4,6-9(周)', '[06-07节]', '11#132大', '4');
INSERT INTO `class2016201110` VALUES (1, '机械设计基础B', '贾鹏', '3(周)', '[06-07节]', '11#132大', '6');
INSERT INTO `class2016201110` VALUES (1, '离散数学', '付岩', '3(周)', '[06-07节]', '21B', '1');
INSERT INTO `class2016201110` VALUES (1, '离散数学', '付岩', '3(周)', '[06-07节]', '21B', '3');
INSERT INTO `class2016201110` VALUES (1, '离散数学', '付岩', '1-2(周)', '[08-10节]', '21B', '1');
INSERT INTO `class2016201110` VALUES (1, '离散数学', '付岩', '1-2(周)', '[08-10节]', '21B', '2');
INSERT INTO `class2016201110` VALUES (1, '计算机网络', '刘成刚', '1-10(周)', '[03-04节]', '21B', '3');
INSERT INTO `class2016201110` VALUES (1, '计算机网络', '刘成刚', '1-4,6-11(周)', '[06-07节]', '21B', '5');
INSERT INTO `class2016201110` VALUES (1, '软件工程基础', '王宇华,张泽宝', '1-8(周)', '[06-07节]', '21B', '2');
INSERT INTO `class2016201110` VALUES (1, '软件工程基础', '王宇华,张泽宝', '1-4,6-9(周)', '[11-12节]', '21B', '4');
INSERT INTO `class2016201110` VALUES (1, '软件质量保证与测试', '高迪', '13(周)', '[06-09节]', '21B', '2');
INSERT INTO `class2016201110` VALUES (1, '软件质量保证与测试', '高迪', '14-16(周)', '[08-10节]', '计算中心376室', '5');
INSERT INTO `class2016201110` VALUES (1, '软件质量保证与测试', '高迪', '9-12(周)', '[11-13节]', '21B', '3');

-- ----------------------------
-- Table structure for class2016201114
-- ----------------------------
DROP TABLE IF EXISTS `class2016201114`;
CREATE TABLE `class2016201114`  (
  `Cid` int(4) NULL DEFAULT NULL,
  `Cname` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `Cteach` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `Clast` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `Ctime` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `Cadr` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `Cday` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  PRIMARY KEY (`Cname`, `Ctime`, `Cday`) USING BTREE
) ENGINE = InnoDB CHARACTER SET = utf8 COLLATE = utf8_general_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of class2016201114
-- ----------------------------
INSERT INTO `class2016201114` VALUES (1, 'ACM程序设计', '王宇华,国林', '1-2,4,6-10(周)', '[11-13节]', '计算中心284室', '5');
INSERT INTO `class2016201114` VALUES (1, '体育（四）', '刘立军', '3-18(周)', '[03-04节]', '室外篮球场', '1');
INSERT INTO `class2016201114` VALUES (1, '大学英语（四）', '李宝峰', '1-4,6-17(周)', '[03-04节]', '41#415', '5');
INSERT INTO `class2016201114` VALUES (1, '形势与政策（三）', '胡泊', '2,4,6,8(周)', '[06-07节]', '1#S103', '1');
INSERT INTO `class2016201114` VALUES (1, '操作系统', '刘刚', '1-8(周)', '[08-10节]', '21B 414中', '3');
INSERT INTO `class2016201114` VALUES (1, '操作系统', '刘刚', '1-4,6-9(周)', '[08-10节]', '21B 414中', '4');
INSERT INTO `class2016201114` VALUES (1, '操作系统实验', '刘刚', '14-17(周)', '[01-04节]', '计算中心376室', '4');
INSERT INTO `class2016201114` VALUES (1, '操作系统实验', '刘刚', '14-17(周)', '[06-09节]', '计算中心376室', '2');
INSERT INTO `class2016201114` VALUES (1, '数据库原理', '徐悦竹', '3-8,10-11(周)', '[01-02节]', '21B 514中', '2');
INSERT INTO `class2016201114` VALUES (1, '数据库原理', '徐悦竹', '3-4,6-11(周)', '[01-02节]', '21B 514中', '4');
INSERT INTO `class2016201114` VALUES (1, '数据库原理', '徐悦竹', '5-6(周)', '[03-04节]', '计算中心575室', '2');
INSERT INTO `class2016201114` VALUES (1, '数据库原理', '徐悦竹', '4,6(周)', '[03-04节]', '计算中心276室', '4');
INSERT INTO `class2016201114` VALUES (1, '机械设计基础B', '贾鹏', '1-8(周)', '[01-02节]', '11#132大', '1');
INSERT INTO `class2016201114` VALUES (1, '机械设计基础B', '贾鹏', '1-2,4,6-9(周)', '[06-07节]', '11#132大', '4');
INSERT INTO `class2016201114` VALUES (1, '机械设计基础B', '贾鹏', '3(周)', '[06-07节]', '11#132大', '6');
INSERT INTO `class2016201114` VALUES (1, '涉密信息系统管理', '赵国冬,孙建国', '11-14(周)', '[01-02节]', '21B 508大', '1');
INSERT INTO `class2016201114` VALUES (1, '涉密信息系统管理', '赵国冬,孙建国', '11-14(周)', '[06-07节]', '21B 508大', '3');
INSERT INTO `class2016201114` VALUES (1, '离散数学（二）', '付岩', '3(周)', '[06-07节]', '21B 413中', '1');
INSERT INTO `class2016201114` VALUES (1, '离散数学（二）', '付岩', '3(周)', '[06-07节]', '21B 413中', '3');
INSERT INTO `class2016201114` VALUES (1, '离散数学（二）', '付岩', '1-2(周)', '[08-10节]', '21B 413中', '1');
INSERT INTO `class2016201114` VALUES (1, '离散数学（二）', '付岩', '1-2(周)', '[08-10节]', '21B 413中', '2');
INSERT INTO `class2016201114` VALUES (1, '计算机网络', '刘成刚', '1-10(周)', '[03-04节]', '21B 502中', '3');
INSERT INTO `class2016201114` VALUES (1, '计算机网络', '刘成刚', '1-4,6-11(周)', '[06-07节]', '21B 502中', '5');
INSERT INTO `class2016201114` VALUES (1, '软件工程基础', '王宇华,张泽宝', '1-8(周)', '[06-07节]', '21B 502中', '2');
INSERT INTO `class2016201114` VALUES (1, '软件工程基础', '王宇华,张泽宝', '1-4,6-9(周)', '[11-12节]', '21B 502中', '4');
INSERT INTO `class2016201114` VALUES (1, '软件工程项目实践', '于金峰', '12-13(周)', '[01-04节]', '计算中心284室', '4');
INSERT INTO `class2016201114` VALUES (1, '软件工程项目实践', '于金峰', '10-13(周)', '[06-09节]', '计算中心284室', '1');
INSERT INTO `class2016201114` VALUES (1, '软件质量保证与测试', '高迪', '13(周)', '[06-09节]', '21B 312中', '2');
INSERT INTO `class2016201114` VALUES (1, '软件质量保证与测试', '高迪', '14-16(周)', '[08-10节]', '计算中心376室', '5');
INSERT INTO `class2016201114` VALUES (1, '软件质量保证与测试', '高迪', '9-12(周)', '[11-13节]', '21B 312中', '3');

-- ----------------------------
-- Table structure for score2016201110
-- ----------------------------
DROP TABLE IF EXISTS `score2016201110`;
CREATE TABLE `score2016201110`  (
  `开课学期` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `课程编号` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `课程名称` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `成绩` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `学分` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `总学时` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `考核方式` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `考试性质` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `课程属性` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `课程性质` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `通识教育选修课程类别` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `成绩标记` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  PRIMARY KEY (`课程名称`, `课程编号`, `开课学期`, `考试性质`) USING BTREE
) ENGINE = InnoDB CHARACTER SET = utf8 COLLATE = utf8_general_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of score2016201110
-- ----------------------------
INSERT INTO `score2016201110` VALUES ('2017-2018-1', '201426338', '世界建筑史（网络）', '优秀', '1.5', '35', '考查', '正常考试', '公选', '中外历史与文化', '中外历史与文化', ' ');
INSERT INTO `score2016201110` VALUES ('2016-2017-2', '201422011', '中国近现代史纲要', '良好', '2', '32', '考查', '正常考试', '必修', '人文与社会科学基础必修课', ' ', ' ');
INSERT INTO `score2016201110` VALUES ('2016-2017-2', '201426203', '书法', '良好', '1', '24', '考查', '正常考试', '公选', '艺术修养与审美', ' ', ' ');
INSERT INTO `score2016201110` VALUES ('2016-2017-1', '201416001', '体育（一）', '良好', '1', '32', '考查', '正常考试', '必修', '人文与社会科学基础必修课', ' ', ' ');
INSERT INTO `score2016201110` VALUES ('2017-2018-1', '201416003', '体育（三）', '优秀', '1', '32', '考查', '正常考试', '必修', '人文与社会科学基础必修课', ' ', ' ');
INSERT INTO `score2016201110` VALUES ('2016-2017-2', '201416002', '体育（二）', '良好', '1', '32', '考查', '正常考试', '必修', '人文与社会科学基础必修课', ' ', ' ');
INSERT INTO `score2016201110` VALUES ('2017-2018-2', '201416004', '体育（四）', '优秀', '1', '32', '考查', '正常考试', '必修', '人文与社会科学基础必修课', ' ', ' ');
INSERT INTO `score2016201110` VALUES ('2016-2017-2', '201418011', '军事理论', '良好', '2', '32', '考查', '正常考试', '必修', '人文与社会科学基础必修课', ' ', ' ');
INSERT INTO `score2016201110` VALUES ('2016-2017-1', '201418001', '军事训练', '良好', '2', '3', '考查', '正常考试', '必修', '基础实践环节', ' ', ' ');
INSERT INTO `score2016201110` VALUES ('2017-2018-2', '201409004', '创业运营演练', '及格', '2', '32', '考查', '正常考试', '公选', '创新创业', '创新创业类', ' ');
INSERT INTO `score2016201110` VALUES ('2017-2018-1', '201411031', '复变函数', '74', '2', '32', '考试', '正常考试', '必修', '自然科学与技术基础必修课', ' ', ' ');
INSERT INTO `score2016201110` VALUES ('2016-2017-2', '201411041', '大学物理上', '92', '4', '64', '考试', '正常考试', '必修', '自然科学与技术基础必修课', ' ', ' ');
INSERT INTO `score2016201110` VALUES ('2017-2018-1', '201411042', '大学物理下A', '63', '4', '64', '考试', '正常考试', '必修', '自然科学与技术基础必修课', ' ', ' ');
INSERT INTO `score2016201110` VALUES ('2016-2017-2', '201411051', '大学物理实验（一）', '中等', '2', '36', '考查', '正常考试', '必修', '基础实践环节', ' ', ' ');
INSERT INTO `score2016201110` VALUES ('2017-2018-1', '201411052', '大学物理实验（二）', '及格', '2', '32', '考查', '正常考试', '必修', '基础实践环节', ' ', ' ');
INSERT INTO `score2016201110` VALUES ('2016-2017-1', '201419001', '大学生心理健康教育', '优秀', '1', '24', '考查', '正常考试', '公选', '哲学人生与社会科学', ' ', ' ');
INSERT INTO `score2016201110` VALUES ('2016-2017-1', '201412001', '大学英语（一）', '82', '1.5', '32', '考试', '正常考试', '必修', '人文与社会科学基础必修课', ' ', ' ');
INSERT INTO `score2016201110` VALUES ('2017-2018-1', '201412003', '大学英语（三）', '63', '1.5', '32', '考试', '正常考试', '必修', '人文与社会科学基础必修课', ' ', ' ');
INSERT INTO `score2016201110` VALUES ('2016-2017-2', '201412002', '大学英语（二）', '77', '1.5', '32', '考试', '正常考试', '必修', '人文与社会科学基础必修课', ' ', ' ');
INSERT INTO `score2016201110` VALUES ('2017-2018-2', '201412004', '大学英语（四）', '78', '1.5', '32', '考试', '正常考试', '必修', '人文与社会科学基础必修课', ' ', ' ');
INSERT INTO `score2016201110` VALUES ('2016-2017-1', '201406001', '大学计算机基础A', '良好', '1', '16', '考查', '正常考试', '必修', '自然科学与技术基础必修课', ' ', ' ');
INSERT INTO `score2016201110` VALUES ('2017-2018-1', '201418102', '孙子兵法', '中等', '1.5', '32', '考查', '正常考试', '公选', '国防文化与船海史话', '国防文化与船海史话', ' ');
INSERT INTO `score2016201110` VALUES ('2017-2018-1', '201402003', '工程力学', '良好', '2.5', '40', '考查', '正常考试', '必修', '自然科学与技术基础必修课', ' ', ' ');
INSERT INTO `score2016201110` VALUES ('2016-2017-2', '201407001', '工程图学基础', '95', '2.5', '40', '考试', '正常考试', '必修', '自然科学与技术基础必修课', ' ', ' ');
INSERT INTO `score2016201110` VALUES ('2016-2017-2', '201417001', '工程认识', '良好', '1', '1', '考查', '正常考试', '必修', '基础实践环节', ' ', ' ');
INSERT INTO `score2016201110` VALUES ('2016-2017-2', '201402144', '建筑艺术赏析', '优秀', '1', '24', '考查', '正常考试', '公选', '专业拓展', ' ', ' ');
INSERT INTO `score2016201110` VALUES ('2017-2018-1', '201422042', '形势与政策（二）', '良好', '0.5', '8', '考查', '正常考试', '必修', '人文与社会科学基础必修课', ' ', ' ');
INSERT INTO `score2016201110` VALUES ('2017-2018-1', '201426205', '影视欣赏', '良好', '1', '24', '考查', '正常考试', '公选', '艺术修养与审美', '艺术修养与审美', ' ');
INSERT INTO `score2016201110` VALUES ('2016-2017-1', '201411001', '微积分A（一）', '74', '6', '96', '考试', '正常考试', '必修', '自然科学与技术基础必修课', ' ', ' ');
INSERT INTO `score2016201110` VALUES ('2016-2017-2', '201411002', '微积分A（二）', '84', '6', '92', '考试', '正常考试', '必修', '自然科学与技术基础必修课', ' ', ' ');
INSERT INTO `score2016201110` VALUES ('2017-2018-1', '201426372', '心理', '优秀', '1', '30', '考查', '正常考试', '公选', '哲学人生与社会科学', '哲学人生与社会科学', ' ');
INSERT INTO `score2016201110` VALUES ('2016-2017-1', '201422001', '思想道德修养与法律基础', '良好', '3', '48', '考查', '正常考试', '必修', '人文与社会科学基础必修课', ' ', ' ');
INSERT INTO `score2016201110` VALUES ('2017-2018-2', '201406122', '操作系统', '86', '3', '48', '考试', '正常考试', '必修', '专业核心课程', ' ', ' ');
INSERT INTO `score2016201110` VALUES ('2017-2018-2', '201406412', '操作系统实验', '良好', '1', '32', '考查', '正常考试', '必修', '专业实践环节', ' ', ' ');
INSERT INTO `score2016201110` VALUES ('2017-2018-2', '201406420', '数据库与信息管理课程设计', '中等', '2', '2', '考查', '正常考试', '必修', '专业实践环节', ' ', ' ');
INSERT INTO `score2016201110` VALUES ('2017-2018-2', '201406124', '数据库原理', '74', '2.5', '40', '考试', '正常考试', '必修', '专业核心课程', ' ', ' ');
INSERT INTO `score2016201110` VALUES ('2017-2018-1', '201406114', '数据结构', '86', '3.5', '56', '考试', '正常考试', '必修', '专业核心课程', ' ', ' ');
INSERT INTO `score2016201110` VALUES ('2017-2018-1', '201406413', '数据结构与程序设计实验', '优秀', '1', '32', '考查', '正常考试', '必修', '专业实践环节', ' ', ' ');
INSERT INTO `score2016201110` VALUES ('2016-2017-1', '201410001', '普通化学', '85', '2', '32', '考试', '正常考试', '必修', '自然科学与技术基础必修课', ' ', ' ');
INSERT INTO `score2016201110` VALUES ('2017-2018-2', '201407013', '机械设计基础B', '62', '2', '32', '考试', '正常考试', '必修', '自然科学与技术基础必修课', ' ', ' ');
INSERT INTO `score2016201110` VALUES ('2016-2017-2', '201411021', '概率论与数理统计', '79', '3.5', '56', '考试', '正常考试', '必修', '自然科学与技术基础必修课', ' ', ' ');
INSERT INTO `score2016201110` VALUES ('2017-2018-1', '201408002', '电路基础B', '72', '4', '64', '考试', '正常考试', '必修', '自然科学与技术基础必修课', ' ', ' ');
INSERT INTO `score2016201110` VALUES ('2017-2018-1', '201406118', '离散数学（一）', '81', '3', '48', '考试', '正常考试', '必修', '专业核心课程', ' ', ' ');
INSERT INTO `score2016201110` VALUES ('2017-2018-2', '201406119', '离散数学（二）', '89', '1', '16', '考试', '正常考试', '必修', '专业核心课程', ' ', ' ');
INSERT INTO `score2016201110` VALUES ('2016-2017-2', '201406011', '程序设计基础', '良好', '3', '48', '考查', '正常考试', '必修', '自然科学与技术基础必修课', ' ', ' ');
INSERT INTO `score2016201110` VALUES ('2017-2018-1', '201418101', '第二次世界大战简史', '良好', '1', '24', '考查', '正常考试', '公选', '专业拓展', '专业拓展类', ' ');
INSERT INTO `score2016201110` VALUES ('2016-2017-1', '201411011', '线性代数与解析几何A', '83', '4.5', '72', '考试', '正常考试', '必修', '自然科学与技术基础必修课', ' ', ' ');
INSERT INTO `score2016201110` VALUES ('2017-2018-1', '201426317', '美学原理（网络）', '优秀', '1', '27', '考查', '正常考试', '公选', '艺术修养与审美', '艺术修养与审美', ' ');
INSERT INTO `score2016201110` VALUES ('2017-2018-1', '201426355', '西方美术欣赏（网络）', '优秀', '1', '26', '考查', '正常考试', '公选', '艺术修养与审美', '艺术修养与审美', ' ');
INSERT INTO `score2016201110` VALUES ('2017-2018-1', '201426128', '西方音乐简史与经典作品赏析', '---', '1', '24', '考查', '正常考试', '公选', '艺术修养与审美', '艺术修养与审美', '缺考');
INSERT INTO `score2016201110` VALUES ('2017-2018-1', '201406411', '计算机硬件综合实验', '良好', '1', '32', '考查', '正常考试', '必修', '专业实践环节', ' ', ' ');
INSERT INTO `score2016201110` VALUES ('2017-2018-1', '201406123', '计算机组成原理', '57', '3.5', '56', '考试', '正常考试', '必修', '专业核心课程', ' ', ' ');
INSERT INTO `score2016201110` VALUES ('2017-2018-1', '201406123', '计算机组成原理', '49', '3.5', '56', '考试', '补考', '必修', '专业核心课程', ' ', ' ');
INSERT INTO `score2016201110` VALUES ('2017-2018-2', '201406125', '计算机网络', '88', '2.5', '40', '考试', '正常考试', '必修', '专业核心课程', ' ', ' ');
INSERT INTO `score2016201110` VALUES ('2017-2018-1', '201406130', '软件工程专业导论', '不及格', '1', '16', '考查', '正常考试', '必修', '专业核心课程', ' ', ' ');
INSERT INTO `score2016201110` VALUES ('2017-2018-1', '201406130', '软件工程专业导论', '不及格', '1', '16', '考查', '补考', '必修', '专业核心课程', ' ', ' ');
INSERT INTO `score2016201110` VALUES ('2017-2018-2', '201406121', '软件工程基础', '84', '2', '32', '考试', '正常考试', '必修', '专业核心课程', ' ', ' ');
INSERT INTO `score2016201110` VALUES ('2017-2018-2', '201406323', '软件质量保证与测试', '良好', '1.5', '24', '考查', '正常考试', '任选', '专业选修课程', ' ', ' ');
INSERT INTO `score2016201110` VALUES ('2017-2018-1', '201426376', '逻辑学导论（网络）', '优秀', '1', '22', '考查', '正常考试', '公选', '哲学人生与社会科学', '哲学人生与社会科学', ' ');
INSERT INTO `score2016201110` VALUES ('2017-2018-1', '201406628', '面向对象程序设计', '中等', '2', '32', '考查', '正常考试', '任选', '专业选修课程', ' ', ' ');
INSERT INTO `score2016201110` VALUES ('2017-2018-1', '201422021', '马克思主义基本原理概论', '良好', '3', '48', '考查', '正常考试', '必修', '人文与社会科学基础必修课', ' ', ' ');

-- ----------------------------
-- Table structure for score2016201114
-- ----------------------------
DROP TABLE IF EXISTS `score2016201114`;
CREATE TABLE `score2016201114`  (
  `开课学期` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `课程编号` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `课程名称` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `成绩` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `学分` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `总学时` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `考核方式` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `考试性质` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `课程属性` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `课程性质` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `通识教育选修课程类别` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  `成绩标记` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL,
  PRIMARY KEY (`课程名称`, `课程编号`, `开课学期`, `考试性质`) USING BTREE
) ENGINE = InnoDB CHARACTER SET = utf8 COLLATE = utf8_general_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of score2016201114
-- ----------------------------
INSERT INTO `score2016201114` VALUES ('2017-2018-2', '201406633', 'ACM程序设计', '中等', '1.5', '24', '考查', '正常考试', '任选', '专业选修课程', ' ', ' ');
INSERT INTO `score2016201114` VALUES ('2017-2018-1', '201426346', '中国古代史（网络）', '优秀', '2', '45', '考查', '正常考试', '公选', '中外历史与文化', '中外历史与文化', ' ');
INSERT INTO `score2016201114` VALUES ('2017-2018-1', '201426327', '中国古典小说巅峰', '优秀', '2', '57', '考查', '正常考试', '公选', '语言与文学', '语言与文学', ' ');
INSERT INTO `score2016201114` VALUES ('2016-2017-2', '201422011', '中国近现代史纲要', '中等', '2', '32', '考查', '正常考试', '必修', '人文与社会科学基础必修课', ' ', ' ');
INSERT INTO `score2016201114` VALUES ('2016-2017-1', '201416001', '体育（一）', '优秀', '1', '32', '考查', '正常考试', '必修', '人文与社会科学基础必修课', ' ', ' ');
INSERT INTO `score2016201114` VALUES ('2017-2018-1', '201416003', '体育（三）', '优秀', '1', '32', '考查', '正常考试', '必修', '人文与社会科学基础必修课', ' ', ' ');
INSERT INTO `score2016201114` VALUES ('2016-2017-2', '201416002', '体育（二）', '优秀', '1', '32', '考查', '正常考试', '必修', '人文与社会科学基础必修课', ' ', ' ');
INSERT INTO `score2016201114` VALUES ('2017-2018-2', '201416004', '体育（四）', '优秀', '1', '32', '考查', '正常考试', '必修', '人文与社会科学基础必修课', ' ', ' ');
INSERT INTO `score2016201114` VALUES ('2016-2017-2', '201418011', '军事理论', '良好', '2', '32', '考查', '正常考试', '必修', '人文与社会科学基础必修课', ' ', ' ');
INSERT INTO `score2016201114` VALUES ('2016-2017-1', '201418001', '军事训练', '优秀', '2', '3', '考查', '正常考试', '必修', '基础实践环节', ' ', ' ');
INSERT INTO `score2016201114` VALUES ('2017-2018-1', '201426370', '创新工程实践（网络）', '良好', '2.5', '64', '考查', '正常考试', '公选', '创新创业', '创新创业类', ' ');
INSERT INTO `score2016201114` VALUES ('2017-2018-1', '201411031', '复变函数', '75', '2', '32', '考试', '正常考试', '必修', '自然科学与技术基础必修课', ' ', ' ');
INSERT INTO `score2016201114` VALUES ('2016-2017-2', '201411041', '大学物理上', '84', '4', '64', '考试', '正常考试', '必修', '自然科学与技术基础必修课', ' ', ' ');
INSERT INTO `score2016201114` VALUES ('2017-2018-1', '201411042', '大学物理下A', '61', '4', '64', '考试', '正常考试', '必修', '自然科学与技术基础必修课', ' ', ' ');
INSERT INTO `score2016201114` VALUES ('2016-2017-2', '201411051', '大学物理实验（一）', '良好', '2', '36', '考查', '正常考试', '必修', '基础实践环节', ' ', ' ');
INSERT INTO `score2016201114` VALUES ('2017-2018-1', '201411052', '大学物理实验（二）', '中等', '2', '32', '考查', '正常考试', '必修', '基础实践环节', ' ', ' ');
INSERT INTO `score2016201114` VALUES ('2016-2017-1', '201419001', '大学生心理健康教育', '优秀', '1', '24', '考查', '正常考试', '公选', '哲学人生与社会科学', ' ', ' ');
INSERT INTO `score2016201114` VALUES ('2016-2017-1', '201412001', '大学英语（一）', '72', '1.5', '32', '考试', '正常考试', '必修', '人文与社会科学基础必修课', ' ', ' ');
INSERT INTO `score2016201114` VALUES ('2017-2018-1', '201412003', '大学英语（三）', '70', '1.5', '32', '考试', '正常考试', '必修', '人文与社会科学基础必修课', ' ', ' ');
INSERT INTO `score2016201114` VALUES ('2016-2017-2', '201412002', '大学英语（二）', '68', '1.5', '32', '考试', '正常考试', '必修', '人文与社会科学基础必修课', ' ', ' ');
INSERT INTO `score2016201114` VALUES ('2017-2018-2', '201412004', '大学英语（四）', '66', '1.5', '32', '考试', '正常考试', '必修', '人文与社会科学基础必修课', ' ', ' ');
INSERT INTO `score2016201114` VALUES ('2016-2017-1', '201406001', '大学计算机基础A', '良好', '1', '16', '考查', '正常考试', '必修', '自然科学与技术基础必修课', ' ', ' ');
INSERT INTO `score2016201114` VALUES ('2017-2018-1', '201402003', '工程力学', '良好', '2.5', '40', '考查', '正常考试', '必修', '自然科学与技术基础必修课', ' ', ' ');
INSERT INTO `score2016201114` VALUES ('2016-2017-2', '201407001', '工程图学基础', '87', '2.5', '40', '考试', '正常考试', '必修', '自然科学与技术基础必修课', ' ', ' ');
INSERT INTO `score2016201114` VALUES ('2016-2017-2', '201417001', '工程认识', '良好', '1', '1', '考查', '正常考试', '必修', '基础实践环节', ' ', ' ');
INSERT INTO `score2016201114` VALUES ('2017-2018-1', '201422227', '当代世界的国际冲突', '中等', '1', '24', '考查', '正常考试', '公选', '哲学人生与社会科学', '哲学人生与社会科学', ' ');
INSERT INTO `score2016201114` VALUES ('2017-2018-1', '201422042', '形势与政策（二）', '中等', '0.5', '8', '考查', '正常考试', '必修', '人文与社会科学基础必修课', ' ', ' ');
INSERT INTO `score2016201114` VALUES ('2016-2017-1', '201411001', '微积分A（一）', '87', '6', '96', '考试', '正常考试', '必修', '自然科学与技术基础必修课', ' ', ' ');
INSERT INTO `score2016201114` VALUES ('2016-2017-2', '201411002', '微积分A（二）', '87', '6', '92', '考试', '正常考试', '必修', '自然科学与技术基础必修课', ' ', ' ');
INSERT INTO `score2016201114` VALUES ('2016-2017-1', '201422001', '思想道德修养与法律基础', '中等', '3', '48', '考查', '正常考试', '必修', '人文与社会科学基础必修课', ' ', ' ');
INSERT INTO `score2016201114` VALUES ('2017-2018-2', '201406122', '操作系统', '69', '3', '48', '考试', '正常考试', '必修', '专业核心课程', ' ', ' ');
INSERT INTO `score2016201114` VALUES ('2017-2018-2', '201406412', '操作系统实验', '优秀', '1', '32', '考查', '正常考试', '必修', '专业实践环节', ' ', ' ');
INSERT INTO `score2016201114` VALUES ('2017-2018-2', '201406420', '数据库与信息管理课程设计', '良好', '2', '2', '考查', '正常考试', '必修', '专业实践环节', ' ', ' ');
INSERT INTO `score2016201114` VALUES ('2017-2018-2', '201406124', '数据库原理', '73', '2.5', '40', '考试', '正常考试', '必修', '专业核心课程', ' ', ' ');
INSERT INTO `score2016201114` VALUES ('2017-2018-1', '201406114', '数据结构', '92', '3.5', '56', '考试', '正常考试', '必修', '专业核心课程', ' ', ' ');
INSERT INTO `score2016201114` VALUES ('2017-2018-1', '201406413', '数据结构与程序设计实验', '良好', '1', '32', '考查', '正常考试', '必修', '专业实践环节', ' ', ' ');
INSERT INTO `score2016201114` VALUES ('2016-2017-1', '201410001', '普通化学', '81', '2', '32', '考试', '正常考试', '必修', '自然科学与技术基础必修课', ' ', ' ');
INSERT INTO `score2016201114` VALUES ('2016-2017-2', '201419002', '朋辈心理辅导', '良好', '1.5', '32', '考查', '正常考试', '公选', '哲学人生与社会科学', ' ', ' ');
INSERT INTO `score2016201114` VALUES ('2017-2018-2', '201407013', '机械设计基础B', '62', '2', '32', '考试', '正常考试', '必修', '自然科学与技术基础必修课', ' ', ' ');
INSERT INTO `score2016201114` VALUES ('2016-2017-2', '201411021', '概率论与数理统计', '75', '3.5', '56', '考试', '正常考试', '必修', '自然科学与技术基础必修课', ' ', ' ');
INSERT INTO `score2016201114` VALUES ('2017-2018-1', '201418111', '武经七书', '良好', '1', '24', '考查', '正常考试', '公选', '国防文化与船海史话', '国防文化与船海史话', ' ');
INSERT INTO `score2016201114` VALUES ('2016-2017-2', '201426102', '民族音乐欣赏', '良好', '1', '24', '考查', '正常考试', '公选', '艺术修养与审美', ' ', ' ');
INSERT INTO `score2016201114` VALUES ('2017-2018-1', '201408002', '电路基础B', '76', '4', '64', '考试', '正常考试', '必修', '自然科学与技术基础必修课', ' ', ' ');
INSERT INTO `score2016201114` VALUES ('2017-2018-1', '201406118', '离散数学（一）', '70', '3', '48', '考试', '正常考试', '必修', '专业核心课程', ' ', ' ');
INSERT INTO `score2016201114` VALUES ('2017-2018-2', '201406119', '离散数学（二）', '89', '1', '16', '考试', '正常考试', '必修', '专业核心课程', ' ', ' ');
INSERT INTO `score2016201114` VALUES ('2017-2018-1', '201406634', '科技创新', '中等', '1', '0', '考查', '正常考试', '任选', '专业选修课程', ' ', ' ');
INSERT INTO `score2016201114` VALUES ('2016-2017-2', '201406011', '程序设计基础', '良好', '3', '48', '考查', '正常考试', '必修', '自然科学与技术基础必修课', ' ', ' ');
INSERT INTO `score2016201114` VALUES ('2016-2017-1', '201411011', '线性代数与解析几何A', '88', '4.5', '72', '考试', '正常考试', '必修', '自然科学与技术基础必修课', ' ', ' ');
INSERT INTO `score2016201114` VALUES ('2016-2017-2', '201426202', '美术设计基础', '中等', '1', '24', '考查', '正常考试', '公选', '艺术修养与审美', ' ', ' ');
INSERT INTO `score2016201114` VALUES ('2016-2017-2', '201426107', '舞蹈鉴赏', '良好', '1', '24', '考查', '正常考试', '公选', '艺术修养与审美', ' ', ' ');
INSERT INTO `score2016201114` VALUES ('2017-2018-1', '201412025', '英语口语', '及格', '1', '24', '考查', '正常考试', '公选', '专业拓展', '专业拓展类', ' ');
INSERT INTO `score2016201114` VALUES ('2017-2018-1', '201406411', '计算机硬件综合实验', '优秀', '1', '32', '考查', '正常考试', '必修', '专业实践环节', ' ', ' ');
INSERT INTO `score2016201114` VALUES ('2017-2018-1', '201406123', '计算机组成原理', '81', '3.5', '56', '考试', '正常考试', '必修', '专业核心课程', ' ', ' ');
INSERT INTO `score2016201114` VALUES ('2017-2018-2', '201406125', '计算机网络', '85', '2.5', '40', '考试', '正常考试', '必修', '专业核心课程', ' ', ' ');
INSERT INTO `score2016201114` VALUES ('2017-2018-1', '201406130', '软件工程专业导论', '及格', '1', '16', '考查', '正常考试', '必修', '专业核心课程', ' ', ' ');
INSERT INTO `score2016201114` VALUES ('2017-2018-2', '201406121', '软件工程基础', '87', '2', '32', '考试', '正常考试', '必修', '专业核心课程', ' ', ' ');
INSERT INTO `score2016201114` VALUES ('2017-2018-2', '201406631', '软件工程项目实践', '良好', '1.5', '24', '考查', '正常考试', '任选', '专业选修课程', ' ', ' ');
INSERT INTO `score2016201114` VALUES ('2017-2018-2', '201406323', '软件质量保证与测试', '良好', '1.5', '24', '考查', '正常考试', '任选', '专业选修课程', ' ', ' ');
INSERT INTO `score2016201114` VALUES ('2017-2018-1', '201406628', '面向对象程序设计', '中等', '2', '32', '考查', '正常考试', '任选', '专业选修课程', ' ', ' ');
INSERT INTO `score2016201114` VALUES ('2017-2018-1', '201422021', '马克思主义基本原理概论', '良好', '3', '48', '考查', '正常考试', '必修', '人文与社会科学基础必修课', ' ', ' ');

-- ----------------------------
-- Table structure for student
-- ----------------------------
DROP TABLE IF EXISTS `student`;
CREATE TABLE `student`  (
  `id` int(10) NOT NULL,
  `password` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  PRIMARY KEY (`id`, `password`) USING BTREE
) ENGINE = InnoDB CHARACTER SET = utf8 COLLATE = utf8_general_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of student
-- ----------------------------
INSERT INTO `student` VALUES (2016201110, 'liu536842');
INSERT INTO `student` VALUES (2016201114, '12106436');

SET FOREIGN_KEY_CHECKS = 1;
